PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/wifi_manager/wifi_manager.c
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_AP));
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_AP, &ap_config));
    
    EventBits_t bits = xEventGroupWaitBits(ctx->event_group,
                                          WIFI_AP_STARTED_BIT,
                                          pdFALSE, pdFALSE, pdMS_TO_TICKS(5000));
    
    if (bits & WIFI_AP_STARTED_BIT) {
        ESP_LOGI(TAG, "WiFi Access Point started successfully");
        return ESP_OK;
    } else {
        ESP_LOGW(TAG, "Timeout waiting for AP to start");
        return ESP_ERR_TIMEOUT;
    }
}

esp_err_t wifi_manager_start_sta_ap_mode(const char *ap_ssid, const char *ap_password)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ap_ssid == NULL) {
        ESP_LOGE(TAG, "AP SSID is NULL");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (strlen(ap_ssid) > 32) {
        ESP_LOGE(TAG, "AP SSID too long");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (ap_password != NULL && strlen(ap_password) > 64) {
        ESP_LOGE(TAG, "AP Password too long");
        return ESP_ERR_INVALID_ARG;
    }
    
    ESP_LOGI(TAG, "Starting WiFi STA+AP mode with AP: %s", ap_ssid);
    
    strncpy(ctx->ap_ssid, ap_ssid, sizeof(ctx->ap_ssid) - 1);
    ctx->ap_ssid[sizeof(ctx->ap_ssid) - 1] = '\0';
    
    if (ap_password != NULL) {
        strncpy(ctx->ap_password, ap_password, sizeof(ctx->ap_password) - 1);
        ctx->ap_password[sizeof(ctx->ap_password) - 1] = '\0';
    } else {
        ctx->ap_password[0] = '\0';
    }
    
    wifi_config_t ap_config = {0};
    strncpy((char *)ap_config.ap.ssid, ctx->ap_ssid, sizeof(ap_config.ap.ssid) - 1);
    ap_config.ap.ssid_len = strlen(ctx->ap_ssid);
    
    if (ctx->ap_password[0] != '\0' && strlen(ctx->ap_password) >= 8) {
        strncpy((char *)ap_config.ap.password, ctx->ap_password, sizeof(ap_config.ap.password) - 1);
        ap_config.ap.authmode = WIFI_AUTH_WPA2_PSK;
    } else {
        ap_config.ap.authmode = WIFI_AUTH_OPEN;
    }
    
    ap_config.ap.max_connection = 4;
    ap_config.ap.beacon_interval = 100;
    
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_APSTA));
    ESP_ERROR_CHECK(esp_wifi_set_config(WIFI_IF_AP, &ap_config));
    
    EventBits_t bits = xEventGroupWaitBits(ctx->event_group,
                                          WIFI_AP_STARTED_BIT,
                                          pdFALSE, pdFALSE, pdMS_TO_TICKS(5000));
    
    if (bits & WIFI_AP_STARTED_BIT) {
        ctx->state = WIFI_MANAGER_STATE_STA_AP_MODE;
        if (ctx->state_callback) {
            ctx->state_callback(ctx->state, ctx->user_data);
        }
        ESP_LOGI(TAG, "WiFi STA+AP mode started successfully");
        return ESP_OK;
    } else {
        ESP_LOGW(TAG, "Timeout waiting for AP to start in STA+AP mode");
        return ESP_ERR_TIMEOUT;
    }
}

esp_err_t wifi_manager_stop_ap_mode(void)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ctx->state != WIFI_MANAGER_STATE_AP_MODE && 
        ctx->state != WIFI_MANAGER_STATE_STA_AP_MODE) {
        ESP_LOGW(TAG, "Not in AP or STA+AP mode");
        return ESP_ERR_INVALID_STATE;
    }
    
    ESP_LOGI(TAG, "Stopping WiFi Access Point");
    
    if (ctx->state == WIFI_MANAGER_STATE_STA_AP_MODE && 
        (xEventGroupGetBits(ctx->event_group) & WIFI_CONNECTED_BIT)) {
        ESP_LOGI(TAG, "Switching from STA+AP to STA mode");
        ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
        ctx->state = WIFI_MANAGER_STATE_CONNECTED;
    } else {
        ESP_LOGI(TAG, "Switching to STA mode (disconnected)");
        ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
        ctx->state = WIFI_MANAGER_STATE_DISCONNECTED;
    }
    
    if (ctx->state_callback) {
        ctx->state_callback(ctx->state, ctx->user_data);
    }
    
    return ESP_OK;
}

esp_err_t wifi_manager_set_sta_mode(void) {
    ESP_LOGI(TAG, "Switching to station-only mode");
    
    wifi_manager_stop_ap_mode();
    
    esp_err_t ret = esp_wifi_set_mode(WIFI_MODE_STA);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to set WiFi mode: %s", esp_err_to_name(ret));
        return ret;
    }
    
    return ESP_OK;
}

bool wifi_manager_is_connected(void)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return false;
    }
    
    EventBits_t bits = xEventGroupGetBits(ctx->event_group);
    return (bits & WIFI_CONNECTED_BIT) != 0;
}

esp_err_t wifi_manager_get_ip(char *ip, size_t max_len)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ip == NULL || max_len < 16) {
        ESP_LOGE(TAG, "Invalid buffer for IP address");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (!wifi_manager_is_connected()) {
        ESP_LOGW(TAG, "Not connected to WiFi");
        strncpy(ip, "0.0.0.0", max_len);
        return ESP_ERR_INVALID_STATE;
    }
    
    esp_netif_ip_info_t ip_info;
    ESP_ERROR_CHECK(esp_netif_get_ip_info(ctx->sta_netif, &ip_info));
    
    snprintf(ip, max_len, IPSTR, IP2STR(&ip_info.ip));
    return ESP_OK;
}

esp_err_t wifi_manager_get_ap_ip(char *ip, size_t max_len)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ip == NULL || max_len < 16) {
        ESP_LOGE(TAG, "Invalid buffer for IP address");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (ctx->state != WIFI_MANAGER_STATE_AP_MODE && 
        ctx->state != WIFI_MANAGER_STATE_STA_AP_MODE) {
        ESP_LOGW(TAG, "Not in AP or STA+AP mode");
        strncpy(ip, "0.0.0.0", max_len);
        return ESP_ERR_INVALID_STATE;
    }
    
    esp_netif_ip_info_t ip_info;
    ESP_ERROR_CHECK(esp_netif_get_ip_info(ctx->ap_netif, &ip_info));
    
