PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/wifi_manager/wifi_manager.c
    snprintf(ip, max_len, IPSTR, IP2STR(&ip_info.ip));
    return ESP_OK;
}

esp_err_t wifi_manager_get_rssi(int8_t *rssi)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (rssi == NULL) {
        ESP_LOGE(TAG, "RSSI pointer is NULL");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (!wifi_manager_is_connected()) {
        ESP_LOGW(TAG, "Not connected to WiFi");
        *rssi = -127;
        return ESP_ERR_INVALID_STATE;
    }
    
    if (esp_wifi_sta_get_ap_info(&ctx->ap_info) != ESP_OK) {
        ESP_LOGW(TAG, "Failed to get AP info");
        *rssi = -127;
        return ESP_FAIL;
    }
    
    *rssi = ctx->ap_info.rssi;
    return ESP_OK;
}

wifi_manager_state_t wifi_manager_get_state(void)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        return WIFI_MANAGER_STATE_INIT;
    }
    
    return ctx->state;
}

esp_err_t wifi_manager_get_configured_ssid(char *ssid, size_t max_len)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (ssid == NULL || max_len < 1) {
        ESP_LOGE(TAG, "Invalid buffer for SSID");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (!ctx->credentials_saved) {
        ESP_LOGW(TAG, "No saved WiFi credentials");
        ssid[0] = '\0';
        return ESP_ERR_NOT_FOUND;
    }
    
    strncpy(ssid, ctx->ssid, max_len - 1);
    ssid[max_len - 1] = '\0';
    
    return ESP_OK;
}

esp_err_t wifi_manager_forget_network(void)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    ESP_LOGI(TAG, "Forgetting saved WiFi network");
    
    if (ctx->state == WIFI_MANAGER_STATE_CONNECTED || 
        ctx->state == WIFI_MANAGER_STATE_CONNECTING) {
        ESP_LOGI(TAG, "Disconnecting from current network");
        ESP_ERROR_CHECK(esp_wifi_disconnect());
        
        EventBits_t bits = xEventGroupWaitBits(ctx->event_group,
                                              WIFI_DISCONNECTED_BIT,
                                              pdFALSE, pdFALSE, pdMS_TO_TICKS(5000));
        if ((bits & WIFI_DISCONNECTED_BIT) == 0) {
            ESP_LOGW(TAG, "Timeout waiting for disconnection");
        }
    }
    
    ESP_ERROR_CHECK(config_manager_erase_key("wifi_ssid"));
    ESP_ERROR_CHECK(config_manager_erase_key("wifi_password"));
    
    ctx->ssid[0] = '\0';
    ctx->password[0] = '\0';
    ctx->credentials_saved = false;
    
    if (ctx->state == WIFI_MANAGER_STATE_STA_AP_MODE) {
        ctx->state = WIFI_MANAGER_STATE_AP_MODE;
    } else {
        ctx->state = WIFI_MANAGER_STATE_DISCONNECTED;
    }
    
    if (ctx->state_callback) {
        ctx->state_callback(ctx->state, ctx->user_data);
    }
    
    return ESP_OK;
}

esp_err_t wifi_manager_start_scan(void)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    ESP_LOGI(TAG, "Starting WiFi scan");
    
    if (ctx->scan_in_progress) {
        ESP_LOGW(TAG, "Scan already in progress");
        return ESP_ERR_INVALID_STATE;
    }
    
    wifi_mode_t current_mode;
    esp_err_t ret = esp_wifi_get_mode(&current_mode);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to get WiFi mode: %s", esp_err_to_name(ret));
        return ret;
    }
    
    if (current_mode == WIFI_MODE_AP) {
        ESP_LOGI(TAG, "Switching from AP to AP+STA mode for scanning");
        ret = esp_wifi_set_mode(WIFI_MODE_APSTA);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to switch to AP+STA mode: %s", esp_err_to_name(ret));
            return ret;
        }
        
        ctx->temporary_apsta_mode = true;
        
        vTaskDelay(pdMS_TO_TICKS(500));
    } else {
        ctx->temporary_apsta_mode = false;
    }
    
    xEventGroupClearBits(ctx->event_group, WIFI_SCAN_DONE_BIT);
    
    ctx->scan_in_progress = true;
    
    ret = esp_wifi_scan_start(&ctx->scan_config, false);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start WiFi scan: %s", esp_err_to_name(ret));
        ctx->scan_in_progress = false;
        
        if (ctx->temporary_apsta_mode) {
            ESP_LOGW(TAG, "Reverting to AP mode after scan failure");
            ctx->temporary_apsta_mode = false;
            esp_err_t revert_ret = esp_wifi_set_mode(WIFI_MODE_AP);
            if (revert_ret != ESP_OK) {
                ESP_LOGE(TAG, "Failed to revert to AP mode: %s", esp_err_to_name(revert_ret));
            }
        }
        
        return ret;
    }
    
    ESP_LOGI(TAG, "WiFi scan started successfully");
    return ESP_OK;
}

esp_err_t wifi_manager_get_scan_results(wifi_scan_result_t *results, size_t max_networks, size_t *num_networks)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    if (results == NULL || num_networks == NULL) {
        ESP_LOGE(TAG, "Invalid output parameters");
        return ESP_ERR_INVALID_ARG;
    }
    
    if (ctx->scan_in_progress) {
        ESP_LOGI(TAG, "Waiting for scan to complete");
        
        EventBits_t bits = xEventGroupWaitBits(ctx->event_group,
                                              WIFI_SCAN_DONE_BIT,
                                              pdFALSE, pdFALSE, pdMS_TO_TICKS(10000));
        
        if ((bits & WIFI_SCAN_DONE_BIT) == 0) {
            ESP_LOGW(TAG, "Timeout waiting for scan to complete");
            return ESP_ERR_TIMEOUT;
        }
    }
    
    if (ctx->scan_ap_list == NULL || ctx->scan_ap_count == 0) {
        ESP_LOGW(TAG, "No scan results available");
        *num_networks = 0;
        return ESP_ERR_NOT_FOUND;
    }
    
    size_t count = (ctx->scan_ap_count < max_networks) ? ctx->scan_ap_count : max_networks;
    for (size_t i = 0; i < count; i++) {
        strncpy(results[i].ssid, (char *)ctx->scan_ap_list[i].ssid, sizeof(results[i].ssid) - 1);
        results[i].ssid[sizeof(results[i].ssid) - 1] = '\0';
        results[i].rssi = ctx->scan_ap_list[i].rssi;
        results[i].auth_mode = ctx->scan_ap_list[i].authmode;
    }
    
    *num_networks = count;
    ESP_LOGI(TAG, "Returning %zu scan results", count);
    return ESP_OK;
}

