PQSolutionsPeru/ESP32-IDF/ESP-IDF-HDDESP32/hddesp32/components/wifi_manager/wifi_manager.c
esp_err_t wifi_manager_set_state_callback(void (*callback)(wifi_manager_state_t state, void *user_data), void *user_data)
{
    wifi_manager_context_t *ctx = &s_wifi_manager_ctx;
    
    if (ctx->event_group == NULL) {
        ESP_LOGE(TAG, "WiFi Manager not initialized");
        return ESP_ERR_INVALID_STATE;
    }
    
    ctx->state_callback = callback;
    ctx->user_data = user_data;
    
    return ESP_OK;
}

esp_err_t wifi_manager_handle_disconnection(const char *ap_ssid_prefix, const char *ap_password, int max_attempts) {
    static int reconnect_attempts = 0;
    static int64_t last_reconnect_time = 0;
    int64_t current_time = esp_timer_get_time() / 1000;
    
    if (wifi_manager_is_connected()) {
        reconnect_attempts = 0;
        return ESP_OK;
    }
    
    if (current_time - last_reconnect_time > 10000) {
        last_reconnect_time = current_time;
        
        reconnect_attempts++;
        ESP_LOGI(TAG, "WiFi disconnected, reconnection attempt %d/%d", 
                 reconnect_attempts, max_attempts);
        
        esp_err_t ret = wifi_manager_connect_saved();
        
        if (reconnect_attempts >= max_attempts && ret != ESP_OK) {
            ESP_LOGI(TAG, "Failed to reconnect to WiFi after %d attempts, activating AP mode", 
                     reconnect_attempts);
            
            char ap_ssid[33];
            esp_err_t ap_ret = wifi_manager_generate_ap_ssid(ap_ssid, sizeof(ap_ssid), ap_ssid_prefix);
            if (ap_ret != ESP_OK) {
                ESP_LOGE(TAG, "Failed to generate AP SSID");
                return ESP_FAIL;
            }
            
            ESP_LOGI(TAG, "Starting AP with SSID: %s", ap_ssid);
            
            ap_ret = wifi_manager_start_ap_mode(ap_ssid, ap_password);
            if (ap_ret != ESP_OK) {
                ESP_LOGE(TAG, "Failed to start AP mode");
                return ESP_FAIL;
            }
            
            reconnect_attempts = 0;
        }
    }
    
    return ESP_OK;
}

esp_err_t wifi_manager_generate_ap_ssid(char *ap_ssid, size_t max_len, const char *prefix)
{
    if (ap_ssid == NULL || max_len < 8 || prefix == NULL) {
        ESP_LOGE(TAG, "Invalid parameters for AP SSID generation");
        return ESP_ERR_INVALID_ARG;
    }
    
    char esp32_id[ESP32_ID_LENGTH + 1];
    esp_err_t ret = esp32_id_manager_get_id(esp32_id, sizeof(esp32_id));
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to get ESP32 ID");
        return ret;
    }
    
    size_t id_len = strlen(esp32_id);
    size_t prefix_len = strlen(prefix);
    
    if (id_len < 6 || prefix_len + 7 > max_len) {
        ESP_LOGE(TAG, "ID too short or buffer too small");
        return ESP_ERR_INVALID_ARG;
    }
    
    snprintf(ap_ssid, max_len, "%s_%s", prefix, &esp32_id[id_len - 6]);
    
    ESP_LOGI(TAG, "Generated AP SSID: %s", ap_ssid);
    return ESP_OK;
}